1. Qual o número de imóveis por ano de construção?
2. Qual o menor número de quartos por ano de construção dos imóveis?
3. Qual o preço de compra mais alto por cada número de quartos?
4. Qual a soma de todos os preços de compra por cada número de quartos?
5. Qual a soma de todos os preços de compra pelo número de quartos e banheiros?
6. Qual o tamanho médio das salas dos imóveis por ano de construção?
7. Qual o tamanho mediano das salas dos imóveis por ano de construção?
8. Qual o desvio-padrão do tamanho das salas dos imóveis por ano de construção?
9. Como é o crescimento médio preços de compra dos imóveis, por dia e semana do ano?
10. Eu gostaria de olhar no mapa e conseguir identificar as casas com o maior preço.

In [41]:
import numpy  as np
import pandas as pd
import seaborn as sns
pd.set_option('display.float_format', lambda x: '%.0f' % x) #suprimir a notação científica em Pandas

In [42]:
data = pd.read_csv('https://raw.githubusercontent.com/siquette/Analise-de-Dados-com-Python/main/m2/archive/kc_house_data.csv')

1. Qual o número de imóveis por ano de construção?

In [43]:
data["date"] = pd.to_datetime(data["date"])

In [44]:
data.groupby(data['date'].dt.year).size()

date
2014    14633
2015     6980
dtype: int64

2. Qual o menor número de quartos por ano de construção dos imóveis?

In [45]:
data.groupby([data['date'].dt.year, 'bedrooms']).size()

date  bedrooms
2014  0              9
      1            138
      2           1844
      3           6612
      4           4724
      5           1081
      6            176
      7             30
      8             11
      9              3
      10             3
      11             1
      33             1
2015  0              4
      1             61
      2            916
      3           3212
      4           2158
      5            520
      6             96
      7              8
      8              2
      9              3
dtype: int64

3. Qual o preço de compra mais alto por cada número de quartos?

In [46]:
data[['price', 'bedrooms']].groupby('bedrooms').max()

           price
bedrooms
0        1295650
1        1247000
2        3278000
3        3800000
4        4489000
5        7062500
6        7700000
7        3200000
8        3300000
9        1400000
10       1148000
11        520000
33        640000

4. Qual a soma de todos os preços de compra por cada número de quartos?

In [47]:
data[['price', 'bedrooms']]. groupby('bedrooms').sum()

              price
bedrooms
0           5323550
1          63210934
2        1107788602
3        4580263939
4        4372957028
5        1259346326
6         224541613
7          36145017
8          14366000
9           5363999
10          2458000
11           520000
33           640000

5. Qual a soma de todos os preços de compra pelo número de quartos e banheiros?

In [48]:
data['bathrooms'] = data['bathrooms'].astype(int)

In [49]:
data[['price', 'bedrooms', 'bathrooms']]. groupby(['bedrooms','bathrooms']).sum()

                        price
bedrooms bathrooms
0        0            3907600
         1             516000
         2             899950
1        0            7872450
         1           50831584
         2            4506900
2        0            8897351
         1          807539672
         2          275503729
         3           15847850
3        0            4984201
         1         1745324737
         2         2391779304
         3          406716547
         4           31459150
4        0             975000
         1          591805752
         2         2541466607
         3         1010678439
         4          193759700
         5           34271530
5        1          108817857
         2          449050266
         3          457153410
         4          173720303
         5           47278600
         6           23325890
6        1           14145400
         2           64810920
         3           63665144
         4           51863649
         5            8991500
         6            6480000
         7            6885000
         8            7700000
7        1            1176000
         2            4848000
         3           10747160
         4           14513857
         5            1780000
         6             800000
         8            2280000
8        2            3370000
         3            4156000
         4            4200000
         5             490000
         6            2150000
9        3            1634000
         4            3279999
         7             450000
10       2             650000
         3             660000
         5            1148000
11       3             520000
33       1             640000

6. Qual o tamanho médio das salas dos imóveis por ano de construção?

In [50]:
data[['sqft_living', 'yr_built']].groupby('sqft_living').mean()

             yr_built
sqft_living
290              1963
370              1923
380              1963
384              2003
390              1936
...               ...
9640             1983
9890             2001
10040            1940
12050            1910
13540            1999

[1038 rows x 1 columns]

7. Qual o tamanho mediano das salas dos imóveis por ano de construção?

9. Como é o crescimento médio preços de compra dos imóveis, por dia e semana do ano?

10. Eu gostaria de olhar no mapa e conseguir identificar as casas com o maior preço.

mediana = np.median(data)
media = np.mean(data)
desv_pad = np.std(data)
variancia = np.var(data)

In [51]:
print(data.head(5))

           id       date  price  bedrooms  bathrooms  sqft_living  sqft_lot  \
0  7129300520 2014-10-13 221900         3          1         1180      5650
1  6414100192 2014-12-09 538000         3          2         2570      7242
2  5631500400 2015-02-25 180000         2          1          770     10000
3  2487200875 2014-12-09 604000         4          3         1960      5000
4  1954400510 2015-02-18 510000         3          2         1680      8080

   floors  waterfront  view  ...  grade  sqft_above  sqft_basement  yr_built  \
0       1           0     0  ...      7        1180              0      1955
1       2           0     0  ...      7        2170            400      1951
2       1           0     0  ...      6         770              0      1933
3       1           0     0  ...      7        1050            910      1965
4       1           0     0  ...      8        1680              0      1987

   yr_renovated  zipcode  lat  long  sqft_living15  sqft_lot15
0             0    98178   48  -122           1340        5650
1          1991    98125   48  -122           1690        7639
2             0    98028   48  -122           2720        8062
3             0    98136   48  -122           1360        5000
4             0    98074   48  -122           1800        7503

[5 rows x 21 columns]

In [52]:
print( data.dtypes)

id                        int64
date             datetime64[ns]
price                   float64
bedrooms                  int64
bathrooms                 int64
sqft_living               int64
sqft_lot                  int64
floors                  float64
waterfront                int64
view                      int64
condition                 int64
grade                     int64
sqft_above                int64
sqft_basement             int64
yr_built                  int64
yr_renovated              int64
zipcode                   int64
lat                     float64
long                    float64
sqft_living15             int64
sqft_lot15                int64
dtype: object